; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph2 - mode
	image0 - mode
	thermograph1 - mode
	thermograph3 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star3 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 179)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 115)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star3)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet12)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 147)
	(supports instrument5 image0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 thermograph3)
	(supports instrument6 thermograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 Star3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 117)
	(= (data Planet5 thermograph2) 175)
	(= (data Star6 thermograph2) 193)
	(= (data Planet7 thermograph2) 121)
	(= (data Planet8 thermograph2) 81)
	(= (data Star9 thermograph2) 177)
	(= (data Planet10 thermograph2) 133)
	(= (data Planet11 thermograph2) 215)
	(= (data Planet12 thermograph2) 129)
	(= (data Phenomenon13 thermograph2) 140)
	(= (data Star14 thermograph2) 44)
	(= (data Planet5 image0) 107)
	(= (data Star6 image0) 294)
	(= (data Planet7 image0) 198)
	(= (data Planet8 image0) 201)
	(= (data Star9 image0) 105)
	(= (data Planet10 image0) 125)
	(= (data Planet11 image0) 190)
	(= (data Planet12 image0) 157)
	(= (data Phenomenon13 image0) 93)
	(= (data Star14 image0) 205)
	(= (data Planet5 thermograph1) 115)
	(= (data Star6 thermograph1) 27)
	(= (data Planet7 thermograph1) 115)
	(= (data Planet8 thermograph1) 231)
	(= (data Star9 thermograph1) 55)
	(= (data Planet10 thermograph1) 182)
	(= (data Planet11 thermograph1) 256)
	(= (data Planet12 thermograph1) 105)
	(= (data Phenomenon13 thermograph1) 61)
	(= (data Star14 thermograph1) 196)
	(= (data Planet5 thermograph3) 220)
	(= (data Star6 thermograph3) 196)
	(= (data Planet7 thermograph3) 218)
	(= (data Planet8 thermograph3) 171)
	(= (data Star9 thermograph3) 63)
	(= (data Planet10 thermograph3) 229)
	(= (data Planet11 thermograph3) 22)
	(= (data Planet12 thermograph3) 42)
	(= (data Phenomenon13 thermograph3) 10)
	(= (data Star14 thermograph3) 143)
	(= (slew_time GroundStation2 Star0) 36.64)
	(= (slew_time Star0 GroundStation2) 36.64)
	(= (slew_time GroundStation2 GroundStation1) 24.61)
	(= (slew_time GroundStation1 GroundStation2) 24.61)
	(= (slew_time GroundStation4 Star0) 34.23)
	(= (slew_time Star0 GroundStation4) 34.23)
	(= (slew_time GroundStation4 GroundStation1) 23.49)
	(= (slew_time GroundStation1 GroundStation4) 23.49)
	(= (slew_time GroundStation4 GroundStation2) 2.638)
	(= (slew_time GroundStation2 GroundStation4) 2.638)
	(= (slew_time GroundStation4 Star3) 40.72)
	(= (slew_time Star3 GroundStation4) 40.72)
	(= (slew_time GroundStation1 Star0) 47.17)
	(= (slew_time Star0 GroundStation1) 47.17)
	(= (slew_time Star3 Star0) 14.72)
	(= (slew_time Star0 Star3) 14.72)
	(= (slew_time Star3 GroundStation1) 20.38)
	(= (slew_time GroundStation1 Star3) 20.38)
	(= (slew_time Star3 GroundStation2) 4.643)
	(= (slew_time GroundStation2 Star3) 4.643)
	(= (slew_time Planet5 Star0) 15.38)
	(= (slew_time Star0 Planet5) 15.38)
	(= (slew_time Planet5 GroundStation1) 15.17)
	(= (slew_time GroundStation1 Planet5) 15.17)
	(= (slew_time Planet5 GroundStation2) 3.775)
	(= (slew_time GroundStation2 Planet5) 3.775)
	(= (slew_time Planet5 Star3) 36.87)
	(= (slew_time Star3 Planet5) 36.87)
	(= (slew_time Planet5 GroundStation4) 28.46)
	(= (slew_time GroundStation4 Planet5) 28.46)
	(= (slew_time Star6 Star0) 1.172)
	(= (slew_time Star0 Star6) 1.172)
	(= (slew_time Star6 GroundStation1) 21.86)
	(= (slew_time GroundStation1 Star6) 21.86)
	(= (slew_time Star6 GroundStation2) 44.5)
	(= (slew_time GroundStation2 Star6) 44.5)
	(= (slew_time Star6 Star3) 2.22)
	(= (slew_time Star3 Star6) 2.22)
	(= (slew_time Star6 GroundStation4) 19.52)
	(= (slew_time GroundStation4 Star6) 19.52)
	(= (slew_time Star6 Planet5) 48.47)
	(= (slew_time Planet5 Star6) 48.47)
	(= (slew_time Planet7 Star0) 6.411)
	(= (slew_time Star0 Planet7) 6.411)
	(= (slew_time Planet7 GroundStation1) 3.973)
	(= (slew_time GroundStation1 Planet7) 3.973)
	(= (slew_time Planet7 GroundStation2) 12.38)
	(= (slew_time GroundStation2 Planet7) 12.38)
	(= (slew_time Planet7 Star3) 13.68)
	(= (slew_time Star3 Planet7) 13.68)
	(= (slew_time Planet7 GroundStation4) 29.44)
	(= (slew_time GroundStation4 Planet7) 29.44)
	(= (slew_time Planet7 Planet5) 38.27)
	(= (slew_time Planet5 Planet7) 38.27)
	(= (slew_time Planet7 Star6) 61.14)
	(= (slew_time Star6 Planet7) 61.14)
	(= (slew_time Planet8 Star0) 38.6)
	(= (slew_time Star0 Planet8) 38.6)
	(= (slew_time Planet8 GroundStation1) 54.12)
	(= (slew_time GroundStation1 Planet8) 54.12)
	(= (slew_time Planet8 GroundStation2) 69.29)
	(= (slew_time GroundStation2 Planet8) 69.29)
	(= (slew_time Planet8 Star3) 31.45)
	(= (slew_time Star3 Planet8) 31.45)
	(= (slew_time Planet8 GroundStation4) 61.02)
	(= (slew_time GroundStation4 Planet8) 61.02)
	(= (slew_time Planet8 Planet5) 3.879)
	(= (slew_time Planet5 Planet8) 3.879)
	(= (slew_time Planet8 Star6) 31.04)
	(= (slew_time Star6 Planet8) 31.04)
	(= (slew_time Planet8 Planet7) 52.3)
	(= (slew_time Planet7 Planet8) 52.3)
	(= (slew_time Star9 Star0) 33.45)
	(= (slew_time Star0 Star9) 33.45)
	(= (slew_time Star9 GroundStation1) 20.17)
	(= (slew_time GroundStation1 Star9) 20.17)
	(= (slew_time Star9 GroundStation2) 86.12)
	(= (slew_time GroundStation2 Star9) 86.12)
	(= (slew_time Star9 Star3) 27.03)
	(= (slew_time Star3 Star9) 27.03)
	(= (slew_time Star9 GroundStation4) 26.65)
	(= (slew_time GroundStation4 Star9) 26.65)
	(= (slew_time Star9 Planet5) 11.64)
	(= (slew_time Planet5 Star9) 11.64)
	(= (slew_time Star9 Star6) 46.13)
	(= (slew_time Star6 Star9) 46.13)
	(= (slew_time Star9 Planet7) 11.11)
	(= (slew_time Planet7 Star9) 11.11)
	(= (slew_time Star9 Planet8) 68.13)
	(= (slew_time Planet8 Star9) 68.13)
	(= (slew_time Planet10 Star0) 10.09)
	(= (slew_time Star0 Planet10) 10.09)
	(= (slew_time Planet10 GroundStation1) 55.21)
	(= (slew_time GroundStation1 Planet10) 55.21)
	(= (slew_time Planet10 GroundStation2) 63.93)
	(= (slew_time GroundStation2 Planet10) 63.93)
	(= (slew_time Planet10 Star3) 48.05)
	(= (slew_time Star3 Planet10) 48.05)
	(= (slew_time Planet10 GroundStation4) 84.25)
	(= (slew_time GroundStation4 Planet10) 84.25)
	(= (slew_time Planet10 Planet5) 8.888)
	(= (slew_time Planet5 Planet10) 8.888)
	(= (slew_time Planet10 Star6) 58.89)
	(= (slew_time Star6 Planet10) 58.89)
	(= (slew_time Planet10 Planet7) 7.573)
	(= (slew_time Planet7 Planet10) 7.573)
	(= (slew_time Planet10 Planet8) 7.09)
	(= (slew_time Planet8 Planet10) 7.09)
	(= (slew_time Planet10 Star9) 86.39)
	(= (slew_time Star9 Planet10) 86.39)
	(= (slew_time Planet11 Star0) 75.98)
	(= (slew_time Star0 Planet11) 75.98)
	(= (slew_time Planet11 GroundStation1) 2.728)
	(= (slew_time GroundStation1 Planet11) 2.728)
	(= (slew_time Planet11 GroundStation2) 66.28)
	(= (slew_time GroundStation2 Planet11) 66.28)
	(= (slew_time Planet11 Star3) 26.02)
	(= (slew_time Star3 Planet11) 26.02)
	(= (slew_time Planet11 GroundStation4) 20.3)
	(= (slew_time GroundStation4 Planet11) 20.3)
	(= (slew_time Planet11 Planet5) 41.42)
	(= (slew_time Planet5 Planet11) 41.42)
	(= (slew_time Planet11 Star6) 8.241)
	(= (slew_time Star6 Planet11) 8.241)
	(= (slew_time Planet11 Planet7) 15.82)
	(= (slew_time Planet7 Planet11) 15.82)
	(= (slew_time Planet11 Planet8) 3.015)
	(= (slew_time Planet8 Planet11) 3.015)
	(= (slew_time Planet11 Star9) 37.65)
	(= (slew_time Star9 Planet11) 37.65)
	(= (slew_time Planet11 Planet10) 53.19)
	(= (slew_time Planet10 Planet11) 53.19)
	(= (slew_time Planet12 Star0) 11.32)
	(= (slew_time Star0 Planet12) 11.32)
	(= (slew_time Planet12 GroundStation1) 48.5)
	(= (slew_time GroundStation1 Planet12) 48.5)
	(= (slew_time Planet12 GroundStation2) 5.986)
	(= (slew_time GroundStation2 Planet12) 5.986)
	(= (slew_time Planet12 Star3) 28.01)
	(= (slew_time Star3 Planet12) 28.01)
	(= (slew_time Planet12 GroundStation4) 17.12)
	(= (slew_time GroundStation4 Planet12) 17.12)
	(= (slew_time Planet12 Planet5) 6.082)
	(= (slew_time Planet5 Planet12) 6.082)
	(= (slew_time Planet12 Star6) 47.14)
	(= (slew_time Star6 Planet12) 47.14)
	(= (slew_time Planet12 Planet7) 43.18)
	(= (slew_time Planet7 Planet12) 43.18)
	(= (slew_time Planet12 Planet8) 18.55)
	(= (slew_time Planet8 Planet12) 18.55)
	(= (slew_time Planet12 Star9) 23.07)
	(= (slew_time Star9 Planet12) 23.07)
	(= (slew_time Planet12 Planet10) 42.12)
	(= (slew_time Planet10 Planet12) 42.12)
	(= (slew_time Planet12 Planet11) 29.64)
	(= (slew_time Planet11 Planet12) 29.64)
	(= (slew_time Phenomenon13 Star0) 32.06)
	(= (slew_time Star0 Phenomenon13) 32.06)
	(= (slew_time Phenomenon13 GroundStation1) 42.61)
	(= (slew_time GroundStation1 Phenomenon13) 42.61)
	(= (slew_time Phenomenon13 GroundStation2) 65.97)
	(= (slew_time GroundStation2 Phenomenon13) 65.97)
	(= (slew_time Phenomenon13 Star3) 29.95)
	(= (slew_time Star3 Phenomenon13) 29.95)
	(= (slew_time Phenomenon13 GroundStation4) 66.29)
	(= (slew_time GroundStation4 Phenomenon13) 66.29)
	(= (slew_time Phenomenon13 Planet5) 26.86)
	(= (slew_time Planet5 Phenomenon13) 26.86)
	(= (slew_time Phenomenon13 Star6) 9.545)
	(= (slew_time Star6 Phenomenon13) 9.545)
	(= (slew_time Phenomenon13 Planet7) 55.24)
	(= (slew_time Planet7 Phenomenon13) 55.24)
	(= (slew_time Phenomenon13 Planet8) 16.24)
	(= (slew_time Planet8 Phenomenon13) 16.24)
	(= (slew_time Phenomenon13 Star9) 8.992)
	(= (slew_time Star9 Phenomenon13) 8.992)
	(= (slew_time Phenomenon13 Planet10) 55.91)
	(= (slew_time Planet10 Phenomenon13) 55.91)
	(= (slew_time Phenomenon13 Planet11) 21.79)
	(= (slew_time Planet11 Phenomenon13) 21.79)
	(= (slew_time Phenomenon13 Planet12) 64.72)
	(= (slew_time Planet12 Phenomenon13) 64.72)
	(= (slew_time Star14 Star0) 11.72)
	(= (slew_time Star0 Star14) 11.72)
	(= (slew_time Star14 GroundStation1) 32.25)
	(= (slew_time GroundStation1 Star14) 32.25)
	(= (slew_time Star14 GroundStation2) 58.24)
	(= (slew_time GroundStation2 Star14) 58.24)
	(= (slew_time Star14 Star3) 57.9)
	(= (slew_time Star3 Star14) 57.9)
	(= (slew_time Star14 GroundStation4) 47.47)
	(= (slew_time GroundStation4 Star14) 47.47)
	(= (slew_time Star14 Planet5) 38.66)
	(= (slew_time Planet5 Star14) 38.66)
	(= (slew_time Star14 Star6) 20.26)
	(= (slew_time Star6 Star14) 20.26)
	(= (slew_time Star14 Planet7) 60.06)
	(= (slew_time Planet7 Star14) 60.06)
	(= (slew_time Star14 Planet8) 13.26)
	(= (slew_time Planet8 Star14) 13.26)
	(= (slew_time Star14 Star9) 27.36)
	(= (slew_time Star9 Star14) 27.36)
	(= (slew_time Star14 Planet10) 45.97)
	(= (slew_time Planet10 Star14) 45.97)
	(= (slew_time Star14 Planet11) 41.82)
	(= (slew_time Planet11 Star14) 41.82)
	(= (slew_time Star14 Planet12) 80.67)
	(= (slew_time Planet12 Star14) 80.67)
	(= (slew_time Star14 Phenomenon13) 50.14)
	(= (slew_time Phenomenon13 Star14) 50.14)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 Planet12)
	(pointing satellite2 Planet8)
	(have_image Planet5 image0)
	(have_image Star6 thermograph2)
	(have_image Planet7 thermograph1)
	(have_image Planet8 thermograph1)
	(have_image Star9 thermograph2)
	(have_image Planet11 thermograph3)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 thermograph1)
	(have_image Star14 thermograph3)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 star6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 115 to 112.78, (fuel-used) from 0 to 2.22
   goals met: 0 of 11
2. (turn_to satellite3 groundstation1 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 groundstation1)
   changed: (fuel satellite3) from 117 to 62.88, (fuel-used) from 2.22 to 56.34
   goals met: 0 of 11
3. (turn_to satellite2 planet8 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 147 to 128.45, (fuel-used) from 56.34 to 74.89
   goals met: 1 of 11
4. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 11
5. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 11
6. (turn_to satellite3 planet11 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet11)
   changed: (fuel satellite3) from 62.88 to 60.152, (fuel-used) from 74.89 to 77.618
   goals met: 1 of 11
7. (turn_to satellite3 groundstation1 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 groundstation1)
   changed: (fuel satellite3) from 60.152 to 57.424, (fuel-used) from 77.618 to 80.346
   goals met: 1 of 11
8. (turn_to satellite3 planet11 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet11)
   changed: (fuel satellite3) from 57.424 to 54.696, (fuel-used) from 80.346 to 83.074
   goals met: 1 of 11
9. (turn_to satellite3 groundstation1 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 groundstation1)
   changed: (fuel satellite3) from 54.696 to 51.968, (fuel-used) from 83.074 to 85.802
   goals met: 1 of 11
10. (calibrate satellite3 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 1 of 11
11. (turn_to satellite3 planet11 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet11)
   changed: (fuel satellite3) from 51.968 to 49.24, (fuel-used) from 85.802 to 88.53
   goals met: 1 of 11
12. (turn_to satellite3 groundstation1 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 groundstation1)
   changed: (fuel satellite3) from 49.24 to 46.512, (fuel-used) from 88.53 to 91.258
   goals met: 1 of 11
13. (turn_to satellite3 planet11 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet11)
   changed: (fuel satellite3) from 46.512 to 43.784, (fuel-used) from 91.258 to 93.986
   goals met: 1 of 11
14. (turn_to satellite3 planet5 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet5)
   changed: (fuel satellite3) from 43.784 to 2.364, (fuel-used) from 93.986 to 135.406
   goals met: 1 of 11
15. (turn_to satellite1 planet11 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet11)
   changed: (fuel satellite1) from 112.78 to 104.539, (fuel-used) from 135.406 to 143.647
   goals met: 1 of 11
16. (turn_to satellite2 groundstation1 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 128.45 to 74.33, (fuel-used) from 143.647 to 197.767
   goals met: 0 of 11
17. (turn_to satellite1 planet7 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 104.539 to 88.719, (fuel-used) from 197.767 to 213.587
   goals met: 0 of 11
18. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 11
19. (turn_to satellite2 planet11 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet11)
   changed: (fuel satellite2) from 74.33 to 71.602, (fuel-used) from 213.587 to 216.315
   goals met: 0 of 11
20. (turn_to satellite2 star14 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star14)
   changed: (fuel satellite2) from 71.602 to 29.782, (fuel-used) from 216.315 to 258.135
   goals met: 0 of 11
21. (turn_to satellite1 planet11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet11)
   changed: (fuel satellite1) from 88.719 to 72.899, (fuel-used) from 258.135 to 273.955
   goals met: 0 of 11
22. (take_image satellite2 star14 instrument4 thermograph3)
   added: (have_image star14 thermograph3)
   changed: (data_capacity satellite2) from 1000 to 857, (data-stored) from 0 to 143
   goals met: 1 of 11
23. (turn_to satellite2 planet8 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 29.782 to 16.522, (fuel-used) from 273.955 to 287.215
   goals met: 2 of 11
24. (turn_to satellite1 groundstation1 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 72.899 to 70.171, (fuel-used) from 287.215 to 289.943
   goals met: 2 of 11
25. (take_image satellite3 planet5 instrument5 image0)
   added: (have_image planet5 image0)
   changed: (data_capacity satellite3) from 1000 to 893, (data-stored) from 143 to 250
   goals met: 3 of 11
26. (turn_to satellite1 planet11 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet11)
   changed: (fuel satellite1) from 70.171 to 67.443, (fuel-used) from 289.943 to 292.671
   goals met: 3 of 11
27. (turn_to satellite1 groundstation1 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 67.443 to 64.715, (fuel-used) from 292.671 to 295.399
   goals met: 3 of 11
28. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 11
29. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 3 of 11
30. (turn_to satellite1 planet11 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet11)
   changed: (fuel satellite1) from 64.715 to 61.987, (fuel-used) from 295.399 to 298.127
   goals met: 3 of 11
31. (take_image satellite1 planet11 instrument2 thermograph3)
   added: (have_image planet11 thermograph3)
   changed: (data_capacity satellite1) from 1000 to 978, (data-stored) from 250 to 272
   goals met: 4 of 11
32. (turn_to satellite1 groundstation1 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 61.987 to 59.259, (fuel-used) from 298.127 to 300.855
   goals met: 4 of 11
33. (turn_to satellite1 planet7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 59.259 to 55.286, (fuel-used) from 300.855 to 304.828
   goals met: 4 of 11
34. (take_image satellite1 planet7 instrument2 thermograph1)
   added: (have_image planet7 thermograph1)
   changed: (data_capacity satellite1) from 978 to 863, (data-stored) from 272 to 387
   goals met: 5 of 11
35. (turn_to satellite1 star9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star9)
   changed: (fuel satellite1) from 55.286 to 44.176, (fuel-used) from 304.828 to 315.938
   goals met: 5 of 11
36. (take_image satellite1 star9 instrument2 thermograph2)
   added: (have_image star9 thermograph2)
   changed: (data_capacity satellite1) from 863 to 686, (data-stored) from 387 to 564
   goals met: 6 of 11
37. (turn_to satellite1 phenomenon13 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon13)
   changed: (fuel satellite1) from 44.176 to 35.184, (fuel-used) from 315.938 to 324.93
   goals met: 6 of 11
38. (take_image satellite1 phenomenon13 instrument2 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   changed: (data_capacity satellite1) from 686 to 625, (data-stored) from 564 to 625
   goals met: 7 of 11
39. (turn_to satellite1 star6 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 35.184 to 25.639, (fuel-used) from 324.93 to 334.475
   goals met: 7 of 11
40. (take_image satellite1 star6 instrument2 thermograph2)
   added: (have_image star6 thermograph2)
   changed: (data_capacity satellite1) from 625 to 432, (data-stored) from 625 to 818
   goals met: 8 of 11
41. (turn_to satellite1 planet11 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet11)
   changed: (fuel satellite1) from 25.639 to 17.398, (fuel-used) from 334.475 to 342.716
   goals met: 8 of 11
42. (turn_to satellite1 planet8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 17.398 to 14.383, (fuel-used) from 342.716 to 345.731
   goals met: 8 of 11
43. (take_image satellite1 planet8 instrument2 thermograph1)
   added: (have_image planet8 thermograph1)
   changed: (data_capacity satellite1) from 432 to 201, (data-stored) from 818 to 1049
   goals met: 9 of 11
44. (turn_to satellite1 planet5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 14.383 to 10.504, (fuel-used) from 345.731 to 349.61
   goals met: 9 of 11
45. (turn_to satellite1 planet12 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet12)
   changed: (fuel satellite1) from 10.504 to 4.422, (fuel-used) from 349.61 to 355.692
   goals met: 10 of 11
46. (take_image satellite1 planet12 instrument2 thermograph1)
   added: (have_image planet12 thermograph1)
   changed: (data_capacity satellite1) from 201 to 96, (data-stored) from 1049 to 1154
   goals met: 11 of 11
